function insertionSort(arr) {
    for (let i = 1; i < arr.length; i++) {
        let temp = arr[i];
        let j = i;
        while (j > 0 && arr[j-1] > temp) {
            arr[j] = arr[j-1]; 
            j--;
        }
        arr[j] = temp;
    }
    return arr
}

console.log(insertionSort([2,1,3,15,9,76,4]))

/*
[5,4,2,3,1]
   ^       //從第二個先開始，往左檢查是否要交換
[4,5,2,3,1]
		   //4跟5換完了
[4,5,2,3,1]
	   ^     //往左檢查是否要交換

...

[2,3,4,5,1]
		     ^ //往左檢查是否要交換，先存下temp = 1
[2,3,4,5,5]
		     ^ //發現前面的比temp大，把前面的複製過來
[2,3,4,4,5] 
		   ^   //左移指針，發現前面的比temp大，把前面的複製過來
[2,3,3,4,5]
		 ^     //左移指針，發現前面的比temp大，把前面的複製過來
[2,2,3,4,5]
   ^       //左移指針，發現前面的比temp大，把前面的複製過來
[2,2,3,4,5]
 ^         //左移指針，沒有更前面了...
[1,2,3,4,5]
 ^         //把temp換回來
*/